---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeFlowState
source: html/7e8a8103-9ac3-c933-2c90-9892a2f27d4a.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFlowState

An enumerated type listing all the pipe flow states for a pipe

## Syntax (C#)
```csharp
public enum PipeFlowState
```